Repository: alaugks/spring-messagesource-xliff-example
Catalog: src/main/resources/translations/messages_*.xlf
Languages: de

source: Headline
de: Überschrift

source: Postcode
de: Postleitzahl

# headline-examples
source: Examples
de: Beispiele

# headline-translation-args
source: Translation with arguments
de: Übersetzung mit Argumenten

# headline-translation-code-not-exists
source: Translation not exists with default text
de: Übersetzung existiert nicht mit Standardtext

# headline-translation-messageformat
source: Translation with MessageFormat
de: Translation mit MessageFormat

# email-notice
source: Your email {0} has been registered.
de: Ihre E-Mail {0} wurde registriert.

# default-message
source: This is a default message.
de: Das ist ein Standardtext.

source: Languages
de: Sprachen

# files-found
source: There {0,choice,0#are no files|1#is one file|1<are {0,number,integer} files}.
de: Es gibt {0,choice,0#keine Datei|1#eine Datei|1<{0,number,integer} Dateien}.
